src_ext/InformationRegisters/УЗ_ВерсииДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_ВерсииДанных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбновлениеНачато</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОшибкиОбновления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>УЗ_Настройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОкругление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьОписаниеКНеоплаченнымУрокам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьОписаниеКНеоплаченнымУрокамС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОповещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодОповещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОповещатьОЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/AccumulationRegisters/УЗ_РасчетыПоЗарплате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>УЗ_РасчетыПоЗарплате</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НеИзменять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src_ext/Enums/УЗ_ВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>УЗ_ВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнутренняяКасса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КассаУченики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочийРасход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_ext/Documents/УЗ_РасходДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_РасходДенег</Name>
			<BasedOn>
				<xr:Item>Catalog.УЗ_ФизЛица</xr:Item>
				<xr:Item>Document.УЗ_РасчетЗарплаты</xr:Item>
				<xr:Item>Catalog.УЗ_Абонемент</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Касса</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_РасчетыПоЗарплате</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Расходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_Урок</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_РасчетЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/Documents/УЗ_РасчетЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_РасчетЗарплаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_РасчетыПоЗарплате</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РКО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_РасходДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перемещение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_ПеремещениеДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УЗ_НачисленияПедагогам</v8:Type>
								<v8:Type>cfg:DocumentRef.УЗ_Урок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начисление</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеИзменять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КОплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/Catalogs/УЗ_Кассы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>УЗ_Кассы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_ext/CommonModules/УЗ_ОбновлениеДанных/Ext/Module.bsl
//Обновление данных учёта занятий — своя замена обработчиков обновления БСП
//(в LM — ОбновлениеИнформационнойБазыМК). Образец — координатор ПЛ_ext («Путевые листы»).
//
//Версия данных в регистре УЗ_ВерсииДанных (одна запись) — номер последнего выполненного
//шага. Координатор идёт от Версия + 1 до АктуальнаяВерсияДанных(); после каждого шага —
//контрольная точка (короткая транзакция под исключительной блокировкой регистра), так что
//прерванное обновление продолжает со следующего шага, а не с первого.
//
//Замок от параллельного запуска — отметка ОбновлениеНачато в той же записи, занимается той
//же короткой транзакцией: два сеанса занять её одновременно не могут. Пока отметка свежее
//СрокЗамка(), второй сеанс уходит молча — данные догонит первый. Упавший шаг замок не
//отпускает: повтор не чаще срока замка, а не при каждом открытии формы. Шаги идемпотентны.
//
//Кто зовёт: ПриСозданииНаСервере журнала уроков и кассового журнала (первое открытие
//раздела). Когда обновлять нечего — одно чтение регистра (тысячные доли секунды), вход
//в программу не тормозит. Внутри транзакции записи не запускается.

//Номер последнего шага — последний в ВыполнитьШаг.
//1 — первичное заполнение: запись настроек (организация и касса по умолчанию, периоды
//    оповещений), основная касса отмечена «Основная» (v1.0)
//2 — виды расхода (решение владельца В7): РКО «Внутренняя касса» с физ. лицом — «Выплата зарплаты»,
//    без физ. лица — «Прочий расход» (v1.1)
//3 — старые выплаты зарплаты без расчёта в основании (В9): на каждую — проведённый расчёт-перенос; уроки
//    проведённых расчётов — в регистр УЗ_УрокиВРасчетахЗарплаты (v1.1)
Функция АктуальнаяВерсияДанных() Экспорт

	Возврат 3;

КонецФункции

//Единая точка догона данных до версии расширения. Ленивая, идемпотентная, никогда не
//роняет вызвавшую форму: ошибка шага — в журнал регистрации и в ресурс ОшибкиОбновления.
Процедура ОбновитьДанныеПриНеобходимости() Экспорт

	Попытка
		Если ВерсияДанных() >= АктуальнаяВерсияДанных() Тогда
			Возврат;
		КонецЕсли;
		Если ТранзакцияАктивна() Тогда
			Возврат;
		КонецЕсли;
		//шаги пишут общие настройки, кассы, расходы и зарплату — права руководителя и администратора;
		//менеджер данные не догоняет (в безопасном режиме расширения привилегированный режим не действует)
		Если Не МожноОбновлятьДанные() Тогда
			Возврат;
		КонецЕсли;

		//без безопасного режима — привилегированно
		УстановитьПривилегированныйРежим(Истина);

		Состояние = ЗанятьЗамок();
		Если Состояние = Неопределено Тогда
			Возврат;
		КонецЕсли;

		Номер = Состояние.Версия + 1;
		Пока Номер <= АктуальнаяВерсияДанных() Цикл
			ВыполнитьШаг(Номер);
			ОтметитьВыполненныйШаг(Номер, Номер = АктуальнаяВерсияДанных());
			Номер = Номер + 1;
		КонецЦикла;

	Исключение
		Подробно = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Учёт занятий.Обновление данных'"),
			УровеньЖурналаРегистрации.Ошибка, , , Подробно);
		Попытка
			ЗаписатьОшибку(Подробно);
		Исключение
			//журнал регистрации уже получил ошибку — регистр версий не обязателен
		КонецПопытки;
	КонецПопытки;

КонецПроцедуры

//Что помешало обновить данные — текст для пользователя; пусто, если всё в порядке
//(или обновление прямо сейчас идёт в другом сеансе). Зовётся формой после
//ОбновитьДанныеПриНеобходимости: отказ не должен теряться молча.
Функция ПроблемаОбновления() Экспорт

	Если ВерсияДанных() >= АктуальнаяВерсияДанных() Тогда
		Возврат "";
	КонецЕсли;
	Если Не МожноОбновлятьДанные() Тогда
		Возврат НСтр("ru = 'Учёт занятий ждёт подготовки своих данных после обновления: руководителю или администратору открыть журнал уроков.'");
	КонецЕсли;
	Если УЗ_Общий.БезопасныйРежимДействует() Тогда
		Возврат НСтр("ru = 'Учёт занятий не смог подготовить свои данные.'") + " " + УЗ_Общий.КакСнятьБезопасныйРежим();
	КонецЕсли;
	Ошибки = СостояниеОбновления().Ошибки;
	Если ПустаяСтрока(Ошибки) Тогда
		Возврат "";
	КонецЕсли;
	Возврат НСтр("ru = 'Учёт занятий не смог подготовить свои данные:'") + " "
		+ СтрПолучитьСтроку(Ошибки, 1) + " " + НСтр("ru = 'Подробности — в журнале регистрации, событие «Учёт занятий.Обновление данных».'");

КонецФункции

//Хватит ли прав текущего пользователя на шаги обновления: запись настроек и версии данных есть у
//руководителя (УЗ_Руководитель) и администратора, у менеджера (УЗ_ОсновнаяРоль) — нет.
Функция МожноОбновлятьДанные()

	Возврат ПравоДоступа("Изменение", Метаданные.РегистрыСведений.УЗ_Настройки)
		И ПравоДоступа("Изменение", Метаданные.РегистрыСведений.УЗ_ВерсииДанных);

КонецФункции

//Состояние для проверок и тестов: Структура(Версия, ОбновлениеНачато, Ошибки).
Функция СостояниеОбновления() Экспорт

	Состояние = Новый Структура("Версия, ОбновлениеНачато, Ошибки", 0, '00010101', "");
	УстановитьПривилегированныйРежим(Истина);
	Запись = РегистрыСведений.УЗ_ВерсииДанных.СоздатьМенеджерЗаписи();
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Состояние.Версия = Запись.Версия;
		Состояние.ОбновлениеНачато = Запись.ОбновлениеНачато;
		Состояние.Ошибки = Запись.ОшибкиОбновления;
	КонецЕсли;
	Возврат Состояние;

КонецФункции

#Область Шаги

Процедура ВыполнитьШаг(Номер)

	Если Номер = 1 Тогда
		ШагПервичногоЗаполнения();	//v1.0
	ИначеЕсли Номер = 2 Тогда
		ШагВидыРасхода();	//v1.1
	ИначеЕсли Номер = 3 Тогда
		ШагРасчетыСтарыхВыплат();	//v1.1
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Шага обновления данных № %1 нет'"), Номер);
	КонецЕсли;

КонецПроцедуры

//Шаг 1. Запись настроек и основная касса. Заполняет только пустое: повторный проход
//и настройки, уже введённые пользователем, не трогает.
Процедура ШагПервичногоЗаполнения()

	ОсновнаяКасса = Справочники.УЗ_Кассы.ОсновнаяКасса;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Кассы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УЗ_Кассы КАК Кассы
	|ГДЕ
	|	Кассы.Основная
	|	И НЕ Кассы.ПометкаУдаления";
	Если Запрос.Выполнить().Пустой() Тогда
		Касса = ОсновнаяКасса.ПолучитьОбъект();
		Касса.Основная = Истина;
		Касса.Записать();
	КонецЕсли;

	Настройки = РегистрыСведений.УЗ_Настройки.Настройки();
	Значения = Новый Структура;
	Если НЕ ЗначениеЗаполнено(Настройки.Касса) Тогда
		Значения.Вставить("Касса", ОсновнаяКасса);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Настройки.Организация) Тогда
		Организация = ПерваяОрганизация();
		Если ЗначениеЗаполнено(Организация) Тогда
			Значения.Вставить("Организация", Организация);
		КонецЕсли;
	КонецЕсли;
	Если Настройки.ПериодОповещения = 0 Тогда
		Значения.Вставить("ПериодОповещения", 300);	//5 минут, как в форме настроек
	КонецЕсли;
	Если Настройки.ОповещатьОЗадолженности = 0 Тогда
		Значения.Вставить("ОповещатьОЗадолженности", 2);	//2 дня
	КонецЕсли;
	Если Значения.Количество() > 0 Тогда
		РегистрыСведений.УЗ_Настройки.ЗаписатьНастройки(Значения);
	КонецЕсли;

КонецПроцедуры

//Шаг 2. Раньше любой РКО «Внутренняя касса» был выплатой зарплаты: аренда на педагога гасила его долг,
//без физ. лица в долг писалась «выплата» пустому педагогу. Теперь выплата — вид «Выплата зарплаты»,
//остальное — «Прочий расход» (решение В7). Старые РКО: с физ. лицом — выплата (движения те же, долг
//не меняется), без физ. лица — прочий расход, его строка в УЗ_РасчетыПоЗарплате убирается (как дало бы
//перепроведение). Раздел кассы у обоих видов прежний — «Внутренняя касса», движения кассы не трогаем.
//Документы пишутся в режиме загрузки: мимо дат запрета и без перепроведения. Идемпотентен: берёт только
//РКО, оставшиеся «Внутренней кассой».
Процедура ШагВидыРасхода()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Расходы.Ссылка КАК Ссылка,
	|	Расходы.ФизЛицо КАК ФизЛицо
	|ИЗ
	|	Документ.УЗ_РасходДенег КАК Расходы
	|ГДЕ
	|	Расходы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.УЗ_ВидыОпераций.ВнутренняяКасса)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭтоВыплата = ЗначениеЗаполнено(Выборка.ФизЛицо);
		НачатьТранзакцию();
		Попытка
			Документ = Выборка.Ссылка.ПолучитьОбъект();
			Документ.ВидОперации = ?(ЭтоВыплата, Перечисления.УЗ_ВидыОпераций.ВыплатаЗарплаты,
				Перечисления.УЗ_ВидыОпераций.ПрочийРасход);
			Документ.ОбменДанными.Загрузка = Истина;
			Документ.Записать();
			Если НЕ ЭтоВыплата Тогда
				Набор = РегистрыНакопления.УЗ_РасчетыПоЗарплате.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(Выборка.Ссылка);
				Набор.ОбменДанными.Загрузка = Истина;
				Набор.Записать();
			КонецЕсли;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

//Шаг 3. С версии 1.1 выплата зарплаты проводится только на основании проведённого расчёта (В9). Старые выплаты
//(шаг 2 и прежние версии) расчёта в основании не имеют — перепроведение такого РКО (дата запрета снята, правка
//комментария) отказывало бы. Как в типовых при вводе нового правила учёта — обработчик обновления приводит старые
//данные к нему: на каждую проведённую выплату без основания создаётся проведённый расчёт-перенос того же педагога,
//организации и кассы на сумму выплаты (одна строка без документа-начисления: уроки старого периода не
//фиксируются и в новые расчёты входят как прежде), выплата получает его в основание. Движения выплаты не меняются,
//расчёт-перенос движений долга не пишет (ведомость переноса — только основание). Идемпотентен: берёт выплаты без
//основания.
Процедура ШагРасчетыСтарыхВыплат() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Выплаты.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УЗ_РасходДенег КАК Выплаты
	|ГДЕ
	|	Выплаты.Проведен
	|	И Выплаты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.УЗ_ВидыОпераций.ВыплатаЗарплаты)
	|	И (Выплаты.ДокументОснования = НЕОПРЕДЕЛЕНО
	|			ИЛИ НЕ Выплаты.ДокументОснования ССЫЛКА Документ.УЗ_РасчетЗарплаты
	|			ИЛИ Выплаты.ДокументОснования = ЗНАЧЕНИЕ(Документ.УЗ_РасчетЗарплаты.ПустаяСсылка))
	|	И Выплаты.ФизЛицо <> ЗНАЧЕНИЕ(Справочник.УЗ_ФизЛица.ПустаяСсылка)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НачатьТранзакцию();
		Попытка
			Выплата = Выборка.Ссылка.ПолучитьОбъект();
			Расчет = Документы.УЗ_РасчетЗарплаты.СоздатьДокумент();
			Расчет.Дата = Выплата.Дата;
			Расчет.Педагог = Выплата.ФизЛицо;
			Расчет.Организация = Выплата.Организация;
			Расчет.Касса = Выплата.Касса;
			Расчет.ДатаНачала = НачалоДня(Выплата.Дата);
			Расчет.ДатаОкончания = НачалоДня(Выплата.Дата);
			Расчет.РКО = Выплата.Ссылка;
			Расчет.Комментарий = НСтр("ru = 'Перенос: выплата до версии 1.1 (обновление данных)'");
			СтрокаДД = Расчет.ДД.Добавить();
			СтрокаДД.Комментарий = СтрШаблон(НСтр("ru = 'Выплата %1 до версии 1.1'"), Выплата.Ссылка);
			СтрокаДД.Начисление = Выплата.СуммаДокумента;
			СтрокаДД.КОплате = Выплата.СуммаДокумента;
			Расчет.СуммаДокумента = Выплата.СуммаДокумента;
			//загрузкой: мимо дат запрета; движения — как у проведённого расчёта (ЗП приход и расход, долг не меняют)
			Расчет.ОбменДанными.Загрузка = Истина;
			Расчет.Проведен = Истина;
			Расчет.Записать();
			Набор = РегистрыНакопления.УЗ_РасчетыПоЗарплате.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Установить(Расчет.Ссылка);
			Для Каждого Вид Из ВидыДвижения() Цикл
				Движение = Набор.Добавить();
				Движение.ВидДвижения = Вид;
				Движение.Период = КонецДня(Расчет.ДатаОкончания);
				Движение.Педагог = Расчет.Педагог;
				Движение.Организация = Расчет.Организация;
				Движение.ЗП = Расчет.СуммаДокумента;
			КонецЦикла;
			Набор.ОбменДанными.Загрузка = Истина;
			Набор.Записать();
			Выплата.ДокументОснования = Расчет.Ссылка;
			Выплата.ОбменДанными.Загрузка = Истина;
			Выплата.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;

	//уроки проведённых расчётов — в регистр УЗ_УрокиВРасчетахЗарплаты (как пишет проведение расчёта с 1.1):
	//урок из ведомости, проведённой до обновления, тоже не отменяется и не меняет начисление
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Расчеты.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УЗ_РасчетЗарплаты КАК Расчеты
	|ГДЕ
	|	Расчеты.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Расчет = Выборка.Ссылка.ПолучитьОбъект();
		Набор = РегистрыСведений.УЗ_УрокиВРасчетахЗарплаты.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(Выборка.Ссылка);
		Расчет.ЗаписатьУрокиВРасчете(Набор, Расчет);
		Набор.ОбменДанными.Загрузка = Истина;
		Набор.Записать();
	КонецЦикла;

КонецПроцедуры

Функция ВидыДвижения()
	Виды = Новый Массив;
	Виды.Добавить(ВидДвиженияНакопления.Приход);
	Виды.Добавить(ВидДвиженияНакопления.Расход);
	Возврат Виды;
КонецФункции

//Организация хозяина: у УНФ/БП/УТ справочник Организации есть у всех, берём первую
//непомеченную по наименованию (у малого бизнеса она обычно одна).
Функция ПерваяОрганизация()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	НЕ Организации.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организации.Наименование";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.Организации.ПустаяСсылка();

КонецФункции

#КонецОбласти

#Область Замок

//Срок, после которого отметка «обновление начато» считается брошенной (сеанс упал).
Функция СрокЗамка()

	Возврат 600;

КонецФункции

Функция ВерсияДанных()

	//быстрый путь: одно чтение без блокировок
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Версии.Версия КАК Версия
	|ИЗ
	|	РегистрСведений.УЗ_ВерсииДанных КАК Версии";
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Версия, 0);

КонецФункции

Процедура ЗаписатьСостояние(Состояние)

	Запись = РегистрыСведений.УЗ_ВерсииДанных.СоздатьМенеджерЗаписи();
	Запись.Версия = Состояние.Версия;
	Запись.ОбновлениеНачато = Состояние.ОбновлениеНачато;
	Запись.ОшибкиОбновления = Лев(Состояние.Ошибки, 1000);
	Запись.Записать();

КонецПроцедуры

//Все правки состояния — короткой транзакцией под исключительной блокировкой: два сеанса
//не прочитают одно состояние и не запишут каждый своё поверх чужого.
Функция ЗаблокироватьСостояние()

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.УЗ_ВерсииДанных");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	Возврат СостояниеОбновления();	//перечитываем под блокировкой

КонецФункции

//Неопределено — догонять нечего или замок держит другой сеанс; иначе состояние.
Функция ЗанятьЗамок()

	Занято = Неопределено;
	НачатьТранзакцию();
	Попытка
		Состояние = ЗаблокироватьСостояние();
		Если Состояние.Версия < АктуальнаяВерсияДанных() И НЕ ЗамокСвеж(Состояние) Тогда
			Состояние.ОбновлениеНачато = ТекущаяУниверсальнаяДата();
			ЗаписатьСостояние(Состояние);
			Занято = Состояние;
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	Возврат Занято;

КонецФункции

Функция ЗамокСвеж(Состояние)

	Если НЕ ЗначениеЗаполнено(Состояние.ОбновлениеНачато) Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Состояние.ОбновлениеНачато > ТекущаяУниверсальнаяДата() - СрокЗамка();

КонецФункции

//Контрольная точка: номер шага пишется атомарно; последний шаг отпускает замок,
//промежуточный — продлевает; ошибка прошлого прогона стирается.
Процедура ОтметитьВыполненныйШаг(Номер, ЭтоПоследний)

	НачатьТранзакцию();
	Попытка
		Состояние = ЗаблокироватьСостояние();
		Состояние.Версия = Макс(Состояние.Версия, Номер);
		Состояние.ОбновлениеНачато = ?(ЭтоПоследний, '00010101', ТекущаяУниверсальнаяДата());
		Состояние.Ошибки = "";
		ЗаписатьСостояние(Состояние);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

//Текст ошибки упавшего шага — в запись версий; замок остаётся (повтор не раньше срока).
Процедура ЗаписатьОшибку(Текст)

	НачатьТранзакцию();
	Попытка
		Состояние = ЗаблокироватьСостояние();
		Состояние.Ошибки = Текст;
		ЗаписатьСостояние(Состояние);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

#КонецОбласти
